Revit 2027 API
ElectricalSetting.CircuitNamePhaseB Property
 Circuit Naming by Phase - Phase B Label.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string CircuitNamePhaseB { get; set; }
Public Property CircuitNamePhaseB As String
	Get
	Set
public:
property String^ CircuitNamePhaseB {
	String^ get ();
	void set (String^ value);
}
member CircuitNamePhaseB : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace